#include <iostream>

using namespace std;

int main(){
	int n, i, j, k; 
	float d, s;
	float e = 0.001;
	n = 5;  //количество переменных

	//выделение памяти под матрицу а
	float** a = new float* [n];
		for (i = 0; i <= n; i++)
			a[i] = new float[n];

	float* b = new float[n];  //исходные коэфициенты
	float* x = new float[n];  //результирующий массив

	//инициализация
	a[1][1] = -0.74;  a[1][2] = 0.47;   a[1][3] = -0.15;  a[1][4] = -0.3;   a[1][5] = 0.81;   b[1] = -0.97;
	a[2][1] = 0.01;   a[2][2] = -0.65;  a[2][3] = -0.64;  a[2][4] = 0.58;   a[2][5] = -0.04;  b[2] = -0.86;
	a[3][1] = -0.33;  a[3][2] = 0.01;   a[3][3] = -0.61;  a[3][4] = -0.95;  a[3][5] = 0.19;   b[3] = -0.82;
	a[4][1] = -0.96;  a[4][2] = -0.42;  a[4][3] = -0.03;  a[4][4] = 0.68;   a[4][5] = -0.71;  b[4] = 0.99;
	a[5][1] = 0.07;   a[5][2] = 0.73;   a[5][3] = -0.97;  a[5][4] = 0.84;   a[5][5] = -0.35;  b[5] = -0.11;


	//вывод матрицы на экран
	cout << "\n\n";
	for (i = 1; i <= n; i++)
	{
		for (j = 1; j <= n; j++)
			cout << a[i][j] << "    ";
		cout << b[i] << "\n";
	}

	// прямой ход
	for (k = 1; k <= n; k++) 
	{
		for (j = k + 1; j <= n; j++)
		{
			d = a[j][k] / a[k][k]; 
			for (i = k; i <= n; i++)
			{
				a[j][i] = a[j][i] - d * a[k][i]; 
			}
			b[j] = b[j] - d * b[k]; 
		}
	}

	// обратный ход
	for (k = n; k >= 1; k--) 
	{
		d = 0;
		for (j = k + 1; j <= n; j++)
		{
			s = a[k][j] * x[j]; 
			d = d + s; 
		}
		x[k] = (b[k] - d) / a[k][k]; 
	}

	//вывод матрицы на экран
	cout << "\n\n";
	for (i = 1; i <= n; i++)
	{
		for (j = 1; j <= n; j++)
			cout << a[i][j] << "    ";
		cout << b[i] << "\n";
	}

	cout << "Korni sistemy: " << endl;
	for (i = 1; i <= n; i++)
		cout << "x[" << i << "]=" << x[i] << " " << endl;

}